import { HeroHeader, ContentSection } from "@/types/contents"

/* ====================
[> CUSTOMIZING CONTENT <]
-- Setup image by typing `/image-name.file` (Example: `/header-image.jpg`)
-- Add images by adding files to /public folder
-- Leave blank `` if you don't want to put texts or images
 ==================== */

export const heroHeader: HeroHeader = {
  header: `خدمات شبانه روزی امداد خودرو و مکانیک سیار جوکار`,
  // headertag: `تجربه بیش از ۱۱ سال امداد خودرو حرفه‌ای`,
  tellText: `شماره تماس:`,
  tell: ` 09177483447 ، 09301713447`,
  subheader: `🚨 در هر ساعت از شبانه‌روز، در هر نقطه از سروستان و جاده‌های اطراف، تیم امداد خودرو سروستان آماده است تا مشکل خودروی شما را برطرف کند. از حمل خودرو تا تعمیرات سیار، ما همیشه در کنار شما هستیم!`,
  image: `/hero-img.webp`,
}

export const featureCards: ContentSection = {
  header: `🚗 حمل خودرو به سراسر ایران`,
  subheader: `امداد خودرو سروستان مجهز به ناوگان پیشرفته حمل خودرو شامل:`,
  content: [
    {
      text: `خودروبر کفی هیدرولیکی`,
      subtext: `یدک‌کش و چرخ‌گیر مکانیزه`,
      image: "/car2.jpg",
    },
    {
      text: `خودروسوار ویژه خودروهای لوکس`,
      subtext: `جرثقیل خودروبر برای خودروهای تصادفی`,
      image: "/car6.jpg",
    },
    {
      text: `انتقال خودروهای صفر و کارکرده به سراسر ایران`,
      subtext: `با مناسب‌ترین قیمت و بیمه بارنامه رسمی، خودرو شما را بدون کوچک‌ترین آسیب جابه‌جا می‌کنیم.`,
      image: "/car4.jpg",
    },
  ],
}

export const features: ContentSection = {
  header: `انواع خدمات`,
  subheader: `ما  به شما چه خدماتی ارائه خواهیم داد؟`,
  image: `/features-img.webp`,
  content: [
    {
      text: `🔧 تعمیر و مکانیکی سیار در محل`,
      subtext: `در صورت خرابی خودرو، دیگر نیازی به جابه‌جایی نیست! تیم ما با تجهیزات کامل مکانیکی سیار، در کمترین زمان مشکل خودروی شما را در محل برطرف می‌کند.
       ✅ تعمیر موتور و تنظیم سوپاپ
✅ تعویض تسمه تایم، تسمه دینام و تسمه کولر
✅ تعویض لنت ترمز و روغن‌کاری سیستم ترمز
✅ برق خودرو، باتری‌سازی، شارژ و تعویض باتری
✅ تعویض فیلترها (روغن، هوا، بنزین)
✅ پنچرگیری و تعویض لاستیک در محل`,
      icon: "fileSearch",
    },
    {
      text: `⛽ سوخت‌رسانی سیار`,
      subtext: `در هر نقطه از سروستان که باشید، در صورت تمام شدن سوخت، امدادگران ما با سوخت بنزین یا گازوئیل در محل شما حاضر شده و خودروی شما را آماده حرکت می‌کنند.`,
      icon: "barChart",
    },
    {
      text: `⚠️ امداد جاده‌ای و پشتیبانی فنی`,
      subtext: `در صورت خرابی خودرو در مسیرهای جاده‌ای، تیم ما در کمترین زمان در محل حاضر شده و خدمات عیب‌یابی، تعمیر و حمل خودرو را ارائه می‌دهد.
`,
      icon: "settings",
    },
  ],
}
