import { SiteConfig, ContactConfig } from "@/types"

/* ====================
[> WEBSITE CONFIG <]
-- Fill the details about your website
 ==================== */

const baseUrl = "https://nextlanding.rdev.pro"

export const siteConfig: SiteConfig = {
  name: "امداد خودرو سروستان جوکار",
  author: "redpangilinan",
  description:
    "با خدمات امداد خودرو، مکانیک سیار جوکار و جرثقیل خودرو فارس شیراز سروستان، در هر ساعت از شبانه‌روز به کمک خودروی شما می‌شتابیم. از تعمیرات فوری و حمل خودرو گرفته تا خدمات اضطراری، تیم متخصص ما آماده پاسخگویی به نیازهای شماست.",
  keywords: [
    "سروستان",
    "شیراز",
    "فارس",
    "امداد خودرو",
    "مکانیک سیار",
    "جرثقیل",
    "خودرو",
    "ماشین",
    "تعمیر",
    "تعمیر خودرو",
    "خدمات",
    "خدمات اضطراری",
    "خدمات اضطراری خودرو",
    "تعمیر فوری",
    "تعمیر فوری خودرو",
    "تعمیر خودرو در سروستان",
    "جرثقیل خودرو سروستان",
    "جرثقیل خودرو فارس",
    "مکانیک سیار سروستان",
    "امداد خودرو سروستان",
    "24 ساعته",
    "امداد",
    "پشتیبانی",
    "امداد و پشتیبانی خودرو",
    "امداد خودرو",
    "خدمات مکانیکی سروستان",
    "جرثقیل ماشین بر",
    "خدمات خودرو سریع",
    "خدمات مکانیک سیار",
    "سیار",
    "خدمات جرثقیل خودرو",
  ],
  url: {
    base: baseUrl,
    author: "https://redpangilinan.live",
  },
  ogImage: `${baseUrl}/og.jpg`,
}

export const contactConfig: ContactConfig = {
  email: "janreynald.pangilinan@gmail.com",
}
